print('Выберете единицу измерения (Километры (km), Метры (m), Сантиметры (sm), Миллиметры (mm),Мили (mi), Ярды (yd)). Введите буквы в скобках, выбранной единицы')
a=input()
print('Выберете целевую единицу измерения (Километры (км), Метры (m), Сантиметры (sm), Миллиметры (mm),Мили (mi), Ярды (yd)). Введите буквы в скобках, выбранной единицы')
b=input()
print('Введите число для конвертации')
c=int(input())
k=1
if a=='km':
    k=1000000
elif a=='m':
    k=1000
elif a=='sm':
    k=10
elif a=='mm':
    k=1
elif a=='yd':
    k=914.4
elif a=='mi':
    k=1609344

h=1
if b=='km':
    h=1000000
elif b=='m':
    h=1000
elif b=='sm':
    h=10
elif b=='mm':
    h=1
elif b=='yd':
    h=914.4
elif b=='mi':
    h=1609344

i=((k/h)*c)

print(i)
